[
	{
	    	"name":"Pierre Gasly",
	    	"seasons_alpine":"2023-pesent",
	    	"seasons":"2017-present",
	    	"wins_alpine":"0",
	   	"wins":"1",
	    	"poles_alpine":"0",
	    	"poles":"0",
	    	"races_alpine":"54",
		"races":"162",
		"pic":"pierre.jpg",
		"description":"Pierre Gasly is a French Formula 1 driver currently racing for the Alpine team, having joined them in 2023 after a successful tenure with AlphaTauri.",
 		"career":"Gasly began karting at age six and progressed through various junior single-seater categories, including Formula Renault Eurocup, GP2, and Super Formula, securing championships and vice-championships along the way. He made his F1 debut with Toro Rosso (now AlphaTauri) in 2017 and achieved his first Grand Prix victory at the 2020 Italian Grand Prix. In 2023, Gasly joined Alpine, partnering with fellow Frenchman Esteban Ocon. Throughout the 2023 season, Gasly demonstrated consistent performance, finishing 11th in the Drivers' Championship with 62 points and securing a podium finish at the Dutch Grand Prix. In June 2024, he extended his contract with Alpine until at least the end of 2026, now alongside rookie Jack Doohan following Ocon's departure. Off the track, Gasly has diversified his interests, becoming a co-owner of French football club FC Versailles, reflecting his passion for sports beyond motorsport."
	},
	{
	    	"name":"Esteban Ocon",
	    	"seasons_alpine":"2020-2024",
	    	"seasons":"2016-present",
	    	"wins_alpine":"1",
	   	"wins":"1",
	    	"poles_alpine":"0",
	    	"poles":"0",
	    	"races_alpine":"109",
		"races":"164",
		"pic":"estie.jpg",
		"description":"Ocon's journey to F1 was marked by significant sacrifices; his parents sold their home and lived in a caravan to support his karting career.",
 		"career":"Ocon's breakthrough came in 2021 when he secured his first Formula 1 victory at the Hungarian Grand Prix, marking Alpine's first win since their return to the sport. He further demonstrated his skill with podium finishes at the 2020 Bahrain Grand Prix and the 2023 Monaco Grand Prix. In 2025, Ocon transitioned to Haas F1 Team, bringing his experience and determination to the team. His career reflects resilience and a relentless pursuit of excellence, overcoming early challenges to establish himself as a respected driver in Formula 1."
	},
	{
		"name":"Fernando Alonso",
	   	"seasons_alpine":"2021-2022",
	    	"seasons":"2001-present",
	    	"wins_alpine":"0",
	    	"wins":"32",
	    	"poles_alpine":"0",
	    	"poles":"22",
	    	"races_alpine":"45",
	    	"races":"407",
		"pic":"Alonso.jpg",
		"description":"Fernando Alonso is a 2 time world champion and holds the record for the most race starts. He has been in the sport for over 20 years and had competed in a thirds of the races ever held in Formula 1.",
 		"career":"He started Formula 1 in 2001 with Minardi but moved to Benetton the following year as a test driver and was promoted to Renault for 2003 he won the championship in 2005 and 2006 for Renault before moving to McLaren for 2007. There were issues in McLaren that lead to neither driver winning that season so he returned to Renault in 2008. Nothing happened in Renault so he moved to Ferrari for the 2010 season. He fought for the championship for the next 4 seasons but was beaten by Sebastian Vettel everytime. 2014 didn't go well so he moved back to McLaren but it didn't get any better and he subsequently retired from Formula 1 at the end of the 2018 season. However, he returned to Formula 1 in 2021 to race for Alpine (formerly Renault) and moved to Aston Martin in 2023 and comtinues to drive for them today."
	}
]
