[
	{
	    	"name":"Michael Schumacher",
	    	"seasons_ferrari":"1996-2006",
	    	"seasons":"1991-2006, 2010-2012",
	    	"wins_ferrari":"72",
	   	"wins":"91",
	    	"poles_ferrari":"58",
	    	"poles":"68",
	    	"races_ferrari":"180",
		"races":"308",
		"pic":"Schumacher.jpg",
		"description":"Michael Schumacher is one of the greatest drivers of all time. He won 7 world championships, 5 of which were with Ferrari and he helped the team win 6 of its 16 constructor championships.",
 		"career":"He made his Formula 1 debut in 1991 for Jordan but moved to Benetton for the rest of the season. He went on to win the title in 1994 and 1995 for Benetton before switching to Ferrari for 1996. He didn't win a championship with Ferrari for 5 years but had a few mear-misses on the way battling with Jacques Villeneuve and Mika Hakkinen. He dominated the sport for the next 5 years, making history. His last year at Ferrari was more difficult with a new rival, Fernando Alonso beating him to the title. He spent a few years away from the sport before returning in 2010 to drive for Mercedes however the three year lead to little success and he was consequently replaced by Lewis Hamilton for the 2013 season. Unfortunaly, at the end of his first year in retirement, he fell while skiing in France and suffered serious head injuries. He survived but since the accident there has been little information about his condition from his family."
	},
	{
	    	"name":"Alberto Ascari",
	    	"seasons_ferrari":"1950-1954",
	    	"seasons":"1950-1955",
	    	"wins_ferrari":"13",
	    	"wins":"13",
	    	"poles_ferrari":"13",
	    	"poles":"14",
	    	"races_ferrari":"27",
	    	"races":"32",
		"pic":"Ascari2.jpg",
		"description":"Alberto Ascari was one of the first stars of the sport, competing in the first 5 seasons. He won 2 titles in a row with Ferrari and is the only Italian Ferrari driver to win with them.",
 		"career":"He drove for Ferrari from 1950 to 1953, winning the title in 1952 and 1953. Between the Belgium Grands Prix of 1952 and 1953 he won every race (apart from the Indy 500 which he didn't contest) meaning he won 9 Grand Prix in a row. He intended to drive for Lancia in 1954 but as his new car was delayed he made a series of appearances for Ferrari ans Maserati nut failed to score any points. In 1955 he had a lucky escape when he crashed into the Monaco harbour but 5 days later when he was testing a Ferrari sportscar forthe Supercortemaggiore race, he crashed and died. This happened at Monza and the corner is now named after him."
	},
	{
	    	"name":"John Surtees",
	    	"seasons_ferrari":"1963-1964",
	    	"seasons":"1960-1972",
	    	"wins_ferrari":"4",
	    	"wins":"6",
	    	"poles_ferrari":"4",
	    	"poles":"8",
	    	"races_ferrari":"30",
	    	"races":"112",
		"pic":"Surtees.jpg",
		"description":"John Surtees is the only driver to have won world championships both on bikes and in cars. He claimed the title in Formula 1 in 1964 for Ferrari and the constructors.",
 		"career":"His motorcycle chapmionship wins came before his 1960 F1 debut at Monaco with Lotus. He moved to Cooper before Ferrari in 1963 where he started to find success. He won the championship in 1964 but a crash at Mosport in 1965 spoilt his chances. He created his own team that was competitive for 9 years that won races and a championship in 1980 with Alan Jones."
	},
	{
		"name":"Niki Lauda",
	    	"seasons_ferrari":"1971-1979, 1982-1985",
	    	"seasons":"1974-1977",
	    	"wins_ferrari":"15",
	    	"wins":"25",
	    	"poles_ferrari":"23",
	    	"poles":"24",
	    	"races_ferrari":"57",
	    	"races":"174",
		"pic":"Lauda.jpg",
		"description":"Niki Lauda was one of the few drivers that had a successful comeback in Formula 1. He won 3 championships, 2 of which were in the 70s and the last was when he returned to the sport in the 80s.",
 		"career":"He joined Formula 1 in 1971 with March and moved to BRM for 1973. He joined Ferrari in 1974 and became a race winner and world champion the following year. While fighting James Hunt for the title he crashed horribly at the Nurburgring, he was pulled from the burning wreckage and suffered severe burns to his face and lungs. Incredibly, he survived and returned to the track just 6 weeks later but missed out on th title by one point after withdrawing from the last race in Fuji due to the atrocious conditions. He won his second title the next year before leaving Ferrari for Brabham but the 3 years he spent with them were difficult and he retired. However, in 1982 brought him back to drive for McLaren and in 1984 he beat his teamate, Alain Prost, to the title by half a point. After leaving Formula 1, he returned to the business of running the airline he had set up in the late 70s. He returned to Formula 1 in a managerial capacity with Ferrari in the early 90s and then at Jaguar in 2002. He later became a part of Mercedes' management team and played a key role in helping the team and Lewis Hamilton secure there championships."
	},
	{
		"name":"Fernando Alonso",
	   	"seasons_ferrari":"2010-2014",
	    	"seasons":"2001-present",
	    	"wins_ferrari":"10",
	    	"wins":"32",
	    	"poles_ferrari":"4",
	    	"poles":"22",
	    	"races_ferrari":"97",
	    	"races":"406",
		"pic":"Alonso.jpg",
		"description":"Fernando Alonso is a 2 time world champion and holds the record for the most race starts. He has been in the sport for over 20 years and had competed in a thirds of the races ever held in Formula 1.",
 		"career":"He started Formula 1 in 2001 with Minardi but moved to Benetton the following year as a test driver and was promoted to Renault for 2003 he won the championship in 2005 and 2006 for Renault before moving to McLaren for 2007. There were issues in McLaren that lead to neither driver winning that season so he returned to Renault in 2008. Nothing happened in Renault so he moved to Ferrari for the 2010 season. He fought for the championship for the next 4 seasons but was beaten by Sebastian Vettel everytime. 2014 didn't go well so he moved back to McLaren but it didn't get any better and he subsequently retired from Formula 1 at the end of the 2018 season. However, he returned to Formula 1 in 2021 to race for Alpine (formerly Renault) and moved to Aston Martin in 2023 and comtinues to drive for them today."
	},
	{
	    	"name":"Sebastian Vettel",
	    	"seasons_ferrari":"2015-2020",
	    	"seasons":"2007-2022",
	    	"wins_ferrari":"13",
	   	"wins":"53",
	    	"poles_ferrari":"11",
	    	"poles":"57",
	    	"races_ferrari":"109",
		"races":"300",
		"pic":"finger.jpg",
		"description":"Sebastian Vettel was a child prodigy and joined Formula 1 when he was just 19 years old. In 2010 he became the youngest ever world champion at 23 years old and dominated the sport for the following 3 years accumulating 4 in total.",
 		"career":"He made his Formula 1 debur in 2007 driving for BMW Sauber where he became the youngest driver to score points before he moveds to Toro Rosso for the second half of the year and 2008. At the Italian Grand Prix in 2008 he became the youngest driver in history to win a Grand Prix meaning the Red Bull junior team won a race before the main team. Toro Rosso also finished above Red Bull in the standings that year.</p><p>Vettel moved to Red Bull for 2009 where he won the second race of the season in China which was also Red Bull's first win. The team and Vettel ended up second in their respective championships. In 2010 he was just about in the title fight bewteen his teamate Mark Webber, the McLaren drivers (Hamilton and Button) and Ferrari driver Fernando Alonso. He won by 4 points at the last race of the season in Abu Dhabi making him the youngest driver to ever win a WDC. He dominated the 2011 season winning 11 out of the 19 races and podium finishes in 17 of them. The 2012 title fight was a bit closer but be ended up winning it by 3 points to Fernando Alonso. 2013 was the year he won his last championship but it was also his most dominante winning 13 out of 19 races. This year also made him the most hated Formula 1 driver for how much he kept winning and his attitude meaning on multiple occassions he was booed by fans. This year also saw the infamous multi-21 incident where his teamate Webber was P1 and Vettel P2 and after being told to keep position he overtook Webber and won the race. This lead to Webber remarking 'multi 21 Seb, yeah multi 21' in the cooldown room, increased tensions between the two and in the team and increase hate for Vettel especially after he said that '[he does] not apoligise for winning'. The following year he couldn't get to grips with the new tyres and the RB10 and suffered from reliability problems meaning he was beaten by his new young teamate Daniel Riccardo.</p><p>He moved to Ferrari for the 2015 season to race alongside Kimi Raikkonen. They performed really well however the Mercedes were in another league and beat everyone by a mile but Vettel still won a few races. 2016 was much the same but Red Bull were more of a chanllenge as well. 2017 was Vettel's firsty chance at fightinh for a championship since 2013. He took the lead in the beginning of the season but by the British Grand Prix his lead was cut to only 1 point but by the end of the year Hamilton has passed him and won. He did manage to split the Mercedes though which was the first time the championship hadn't ended 1-2 for Mercedes since 2014. The 2018 season was dubbed the 'Fight For Five' as the two 4 time world champions were in a title fight and like the season before Vettel got of to a good start but it was close for most of the season. A notable race was his home race on Hockenheim where he crashed as rain started causing him to break his front wing; some poeple would say he was never the same after this moment as it cost him his last chance at another title. In 2019 he had a new teamate Charles Leclerc who was only in his second season who ended up outscoring him and Vettel finished the season 5th. 2020 was his last year with Ferrari and with the SF1000 lackingpace he had his worst full campaign in his Formula 1 career.</p><p>For the last 2 years of his career he raced for Aston Martin alongside Lance Stroll and outscored him in both seasons and had the most overtakes in 2019 that won him the inaugural Overtake Award. He missed the first 2 races of the 2022 season due to positive COVID-19 tests and announced his retiremant by the end of the 2022 season. Since retiring Vettel has used his notariaty to raise awareness for environmental issues and social injustices."
	},
	{
	    	"name":"Charles Leclerc",
	    	"seasons_ferrari":"2019-present",
	    	"seasons":"2018-present",
	    	"wins_ferrari":"8",
	   	"wins":"8",
	    	"poles_ferrari":"26",
	    	"poles":"26",
	    	"races_ferrari":"134",
		"races":"155",
		"pic":"Charles.jpg",
		"description":"Charles Leclerc is a generational talent who is yet to win a chamipionship but is one of few drivers to have joined Ferrari in only their second season.",
 		"career":"Before joining Formula 1 Leclerc was a Ferrari junior and won 2 titles in feeder series; FIA Formula 2 and GP3 series in 2017 and 2016 respectively. He debuted in 2018 driving for Sauber alongside Marcus Ericsson who he beat by 39 and finished 13th in the standings by the end of the season and was subsequently named FIA Rookie of the Year. In 2019 he drove for Ferrari with 4-time champion Sebastian Vettel. He got his maiden win at Spa in 2019 and he won the next race in Monza making him the first Ferrari driver to win there since 2010 and earned him the nickname 'il Predestinato' in Italian Media and finished 4th in the championship. The next years however where not great as neither Lerclerc or his teamate (Vettel 2020, Carlos Sainz 2021) won a race and he finished 8th and 7th. In 2022 Ferrari got off to a good start meaning there was a title between Leclerc and Verstappen and achieved 9 pole positions, 3 wins and 11 podiums. 2023 was difficult for everyone but Red Bull and Leclerc managed 5 poles and 6 podiums throughout the season. In 2024 Leclerc had his best ever season with 3 wins and 13 podiums and a fight for the constructors at the last race. He also won his home race, Monaco, after having terrible luck over the last few years there and Monza which he hadn't won since 2019. This year the team have struggled but he has been outperforming his new teamate, Lewis Hamilton."
	},
	{
	    	"name":"Kimi Raikkonen",
	    	"seasons_ferrari":"2001-2021",
	    	"seasons":"2014-2018",
	    	"wins_ferrari":"10",
	   	"wins":"21",
	    	"poles_ferrari":"7",
	    	"poles":"18",
	    	"races_ferrari":"151",
		"races":"315",
		"pic":"kimi.jpg",
		"description":"Kimi Raikkonen was champion in 2007 and has had one of the longest Formula 1 careers spanning 2 decades.",
 		"career":"He began his F1 career in 2001 with Sauber, quickly moving to McLaren, where he secured his first Grand Prix victory in 2003. In 2007, Räikkönen joined Ferrari and clinched the World Championship in a dramatic final race in Brazil, edging out Lewis Hamilton and Fernando Alonso by just one point. After a brief hiatus from F1 in 2010–2011, he returned with Lotus, achieving notable success, including a memorable victory at the 2013 Australian Grand Prix. Räikkönen concluded his F1 career with Alfa Romeo Racing, retiring after the 2021 season with a total of 21 Grand Prix wins and 103 podiums. His legacy is marked by his no-nonsense demeanor, exceptional driving talent, and a career spanning two decades at the pinnacle of motorsport."
	},
	{
	    	"name":"Mike Hawthorn",
	    	"seasons_ferrari":"1953-1958",
	    	"seasons":"1952-1958",
	    	"wins_ferrari":"3",
	   	"wins":"3",
	    	"poles_ferrari":"4",
	    	"poles":"4",
	    	"races_ferrari":"35",
		"races":"46",
		"pic":"hawthorn.jpg",
		"description":"Mike Hawthorn was a Formula 1 driver in the 50s and won the title in 1958 for Ferrari.",
 		"career":"He began his racing career in 1952 and quickly gained attention for his skill and charisma. Notably, Hawthorn won the 1955 24 Hours of Le Mans with Jaguar, though the race was marred by a tragic accident that resulted in 83 spectator fatalities. In 1958, he clinched the World Championship by a single point over Stirling Moss, despite winning only one race that season. Shortly after his championship victory, Hawthorn announced his retirement from racing, deeply affected by the recent death of his teammate Peter Collins. Tragically, just three months later, he died in a road accident on January 22, 1959. In his honor, the RAC established the Hawthorn Memorial Trophy, awarded annually to the most successful British driver in Formula 1."
	},
	{
	    	"name":"Gilles Villeneuve",
	    	"seasons_ferrari":"1978-1982",
	    	"seasons":"1978-1982",
	    	"wins_ferrari":"6",
	   	"wins":"6",
	    	"poles_ferrari":"2",
	    	"poles":"2",
	    	"races_ferrari":"67",
		"races":"67",
		"pic":"gilles.jpg",
		"description":"Gilles Villeneuve was a Formula 1 driver celebrated for his fearless and flamboyant driving style.",
 		"career":"He began his racing career in snowmobile competitions before transitioning to open-wheel racing, where he quickly made a name for himself. Joining Ferrari in 1977, Villeneuve secured six Grand Prix victories and finished as runner-up in the 1979 World Drivers' Championship. His aggressive driving earned him admiration and respect from fans and fellow drivers alike. Tragically, on May 8, 1982, Villeneuve lost his life during qualifying for the Belgian Grand Prix at Zolder, following a collision with Jochen Mass. He was 32 years old. In his honor, the Circuit Île Notre-Dame in Montreal was renamed Circuit Gilles Villeneuve. His son, Jacques Villeneuve, later became the first Canadian to win the Formula 1 World Championship."
	},
	{
	    	"name":"Juan Manuel Fangio",
	    	"seasons_ferrari":"1956",
	    	"seasons":"1950-1958",
	    	"wins_ferrari":"3",
	   	"wins":"24",
	    	"poles_ferrari":"6",
	    	"poles":"29",
	    	"races_ferrari":"7",
		"races":"51",
		"pic":"fangio.jpg",
		"description":"Juan Manuel Fangio often hailed as one of the greatest drivers in Formula 1 history and competed in F1 from 1950 to 1958  and secured five WDC.",
 		"career":"He won the championships in 1951, 1954, 1955, 1956, 1957 driving for Alfa Romeo, Mercedes-Benz, Ferrari, and Maserati. He achieved this feat in just seven full seasons, missing one due to a near-fatal accident. His adaptability was unparalleled, winning titles with four different teams. One of his most iconic performances was at the 1957 German Grand Prix at the Nürburgring, where he overcame a 48-second deficit to clinch victory, securing his fifth and final title in dramatic fashion. After retiring from racing in 1958, Fangio remained an ambassador for the sport and later became a representative for Mercedes-Benz in Argentina. He passed away on July 17, 1995, leaving behind a legacy that continues to inspire generations of drivers."
	},
	{
	    	"name":"Alain Prost",
	    	"seasons_ferrari":"1990-1991",
	    	"seasons":"1980-1991, 1993",
	    	"wins_ferrari":"5",
	   	"wins":"51",
	    	"poles_ferrari":"0",
	    	"poles":"33",
	    	"races_ferrari":"29",
		"races":"199",
		"pic":"prost.jpg",
		"description":"Alain Prost was renowned for his methodical and strategic approach to racing and was nicknamed 'The Professor' and secured 4 WDC.",
 		"career":"He competed for McLaren, Ferrari, and Williams, and was known for his consistency and racecraft, often focusing on maximizing points over raw speed. Prost's rivalry with Ayrton Senna is legendary, with the two drivers often finishing 1–2 in the championship standings during their careers . After retiring in 1993, Prost remained involved in motorsport, founding the Prost Grand Prix team and later serving in advisory roles with Renault and Alpine . His legacy endures as one of Formula 1's most cerebral and accomplished drivers."
	},
	{
	    	"name":"Nigel Mansell",
	    	"seasons_ferrari":"1989-1990",
	    	"seasons":"1980-1992, 1994-1995",
	    	"wins_ferrari":"3",
	   	"wins":"31",
	    	"poles_ferrari":"3",
	    	"poles":"32",
	    	"races_ferrari":"29",
		"races":"187",
		"pic":"mansell.jpg",
		"description":"Nigel Mansell was celebrated for his tenacity and aggressive driving style and he won the WDC in 1992 for Williams.",
 		"career":"Mansell secured 31 Grand Prix victories and clinched the 1992 World Championship with Williams, where he dominated the season with nine wins and five pole positions. Notably, he remains the last driver to win an F1 race over the age of 40, achieving this feat at the 1994 Australian Grand Prix in Adelaide, his 31st and final career victory. Beyond F1, Mansell ventured into American open-wheel racing, winning the 1993 IndyCar World Series with Newman/Haas Racing, making him the only driver to hold both the Formula 1 World Championship and the American open-wheel National Championship simultaneously. His legacy endures as one of Britain's most accomplished and charismatic motorsport figures."
	},
	{
	    	"name":"Phil Hill",
	    	"seasons_ferrari":"1958-1962",
	    	"seasons":"1958-1964, 1966",
	    	"wins_ferrari":"3",
	   	"wins":"3",
	    	"poles_ferrari":"6",
	    	"poles":"6",
	    	"races_ferrari":"31",
		"races":"52",
		"pic":"hill.jpg",
		"description":"Phil Hill was the first American-born driver to win the Formula 1 World Championship, achieving the title in 1961 with Ferrari.",
 		"career":"He began his racing career in the late 1950s and made his F1 debut in 1958. Hill secured three Grand Prix victories and 16 podiums during his F1 career. In addition to his F1 success, Hill was a three-time winner of the 24 Hours of Le Mans (1958, 1961, 1962) and the 12 Hours of Sebring (1958, 1959, 1961). He also won the 1964 Daytona Continental, completing the 'Triple Crown' of endurance racing. Known for his thoughtful and introspective nature, Hill earned the nickname 'Hamlet in a Helmet'. After retiring from racing in 1967, he remained active in the motorsport community as a writer, commentator, and car restoration expert. Hill passed away in 2008 at the age of 81 in Monterey, California."
	},
	{
	    	"name":"Rubens Barrichello",
	    	"seasons_ferrari":"2000-2005",
	    	"seasons":"1993-2011",
	    	"wins_ferrari":"9",
	   	"wins":"11",
	    	"poles_ferrari":"11",
	    	"poles":14",
	    	"races_ferrari":"104",
		"races":"326",
		"pic":"rubens.jpg",
		"description":"Rubens Barrichello is a Brazilian racing driver best known for his long and consistent career in Formula 1.",
 		"career":"He competed from 1993 to 2011 with teams including Jordan, Stewart, Ferrari, Honda, Brawn GP, and Williams. As Michael Schumacher’s teammate at Ferrari (2000–2005), he played a key role in the team’s dominance, securing 11 wins and 68 podiums in total. He later contributed to Brawn GP’s remarkable 2009 championship season. With 322 Grand Prix starts, he was F1’s most experienced driver until surpassed by Kimi Räikkönen. After F1, he raced in IndyCar and won the Stock Car Brasil championship in 2014, earning respect for his skill, perseverance, and sportsmanship throughout his career."
	},
	{
	    	"name":"Eddie Irvine",
	    	"seasons_ferrari":"1996-1999",
	    	"seasons":"1993-2002",
	    	"wins_ferrari":"4",
	   	"wins":"4",
	    	"poles_ferrari":"0",
	    	"poles":0",
	    	"races_ferrari":"65",
		"races":"148",
		"pic":"irvine.jpg",
		"description":"Known for his outspoken personality and solid driving skills, he was Michael Schumacher’s teammate at Ferrari from 1996 to 1999.",
 		"career":"Irvine came closest to winning the championship in 1999 when Schumacher was injured mid-season, and Ferrari backed Irvine’s title bid; he ultimately finished second in the standings behind Mika Häkkinen. Although he won four Grands Prix and earned 26 podiums, his post-Ferrari years at Jaguar were less successful, and he retired from F1 in 2002. He remains a colorful figure in F1 history, remembered for both his driving and his off-track charisma."
	},
	{
	    	"name":"Felipe Massa",
	    	"seasons_ferrari":"2006-2013",
	    	"seasons":"2002, 2004-2017",
	    	"wins_ferrari":"11",
	   	"wins":"11",
	    	"poles_ferrari":"15",
	    	"poles":16",
	    	"races_ferrari":"65",
		"races":"272",
		"pic":"massa.jpg",
		"description":"Felipe Massa raced from 2002 to 2017, primarily known for his time with Ferrari (2006–2013).",
 		"career":"After debuting with Sauber, he joined Ferrari and quickly became a race winner, serving as both a strong teammate to Michael Schumacher and later a title contender. His closest brush with the championship came in 2008, when he famously lost the title to Lewis Hamilton by just one point in a dramatic final-lap twist at the Brazilian Grand Prix. Massa won 11 races, scored 41 podiums, and earned a reputation for his speed, technical skill, and resilience—especially after a life-threatening head injury in 2009. He finished his F1 career with Williams before retiring in 2017, leaving behind a legacy as one of Brazil’s most respected drivers."
	}
]
