[
	{
	    	"name":"Oscar Piastri",
	    	"seasons_mclaren":"2023-present",
	    	"seasons":"2023-present",
	    	"wins_mclaren":"6",
	   	"wins":"6",
	    	"poles_mclaren":"2",
	    	"poles":"2",
	    	"races_mclaren":"52",
		"races":"52",
		"pic":"osc.jpg",
		"description":"Oscar Piastri is a new talent in the sport who won 3 back-to-back championships in feeder series and in his third season is fighting for the title against his more experienced teamate.",
 		"career":"He moved from Australia when he was 15 to pursue karting. In his second year in Formula Renault Eurocup he claimed the title before winning FIA Formula 3 and Formula 2 the following years both in his rookie seasons. His entrance into Formula 1 was not simple thought despite his imprsive background; the year following his Formula 2 title, 2022, he was a reserve driver for Alpine. When Alonso left Alpine to join Aston Msrtin for 2023 the team announced that Piastri would be driving for them in 2023 without discussing it with him.</p><img src='falpine.jpg' width='40%'><p>However, he rejected their announcment 2 hours later on Twitter and it was later announced that he would replace Daniel Riccardo as McLaren for the 2023 season.</p><p>McLaren had a difficult start to the 2023 season with both cars consistently out of the points but with upgrades they worked their way up the grid to finish forth with Piastri even winning the Qatar sprint race before his teamate had won any race format and finishing nineth in the standings. 2024 was a lot better for the team and Piastri as he won 2 races; his maiden win in Hungary where he started P2 and in Baku where he also started P2. He also helped the team secure the WCC for the first time since 1998. The 2025 season didn't start well for the Aussie with a spin at the first race costing him P2 or possibly a win but since that moment he has been a force to be reckened with. He won the race in China from pole then a P3 in Japan followed by 3 wins in a row with only 1 from pole position. He is currently leading the championship and has beaten his more experienced teamate's total career wins and is the only multpile race winner this season so far."
	},
	{
	    	"name":"Ayrton Senna",
	    	"seasons_mclaren":"1988-1993",
	    	"seasons":"1984-1994",
	    	"wins_mclaren":"35",
	   	"wins":"41",
	    	"poles_mclaren":"46",
	    	"poles":"65",
	    	"races_mclaren":"96",
		"races":"162",
		"pic":"senna.jpg",
		"description":"Ayrton Senna is widely regarded as one of the greatest drivers in the sport's history due to his unique driving style and 3 championships.",
 		"career":"Senna began his F1 career in 1984 with Toleman, quickly showcasing his exceptional talent. He moved to Lotus in 1985, where he secured his first Grand Prix victory in 1985 at the Portuguese Grand Prix. Senna's most successful years came with McLaren, where he won three World Championships (1988, 1990, 1991) and achieved 41 Grand Prix victories and 65 pole positions over his 161-race career. He was known for his intense focus, speed, and determination, particularly in qualifying sessions. Tragically, Senna's life and career were cut short when he died in an accident during the 1994 San Marino Grand Prix at Imola, Italy. His death, along with that of fellow driver Roland Ratzenberger during the same weekend, led to significant reforms in F1 safety. Senna's legacy endures through his foundation, which supports education for underprivileged children in Brazil, and through the 2010 documentary Senna, which chronicles his life and career."
	},
	{
	    	"name":"Lewis Hamilton",
	    	"seasons_mclaren":"2007-2012",
	    	"seasons":"2007-present",
	    	"wins_mclaren":"21",
	   	"wins":"105",
	    	"poles_mclaren":"26",
	    	"poles":"104",
	    	"races_mclaren":"110",
		"races":"363",
		"pic":"lewis.jpg",
		"description":"Lewis Hamilton is a British racing driver who competes in Formula One for Ferrari. He has won a joint-record seven Formula One World Drivers' Championship titles tied with Michael Schumacher and holds the records for most wins (105), pole positions (104), and podium finishes (202) in the sport's history.",
 		"career":"Hamilton began his F1 career with McLaren in 2007, finishing third in his debut season and narrowly missing the title in 2008. He joined Mercedes in 2013, where he achieved unprecedented success, securing six of his seven championships between 2014 and 2020. In 2025, Hamilton transitioned to Ferrari, replacing Carlos Sainz and partnering with Charles Leclerc. Off the track, Hamilton is a prominent advocate for diversity and inclusion in motorsport, founding the Hamilton Commission to promote racial equality. He was knighted in 2021 for his services to motorsport and continues to use his platform to champion social justice causes."
	},
	{
		"name":"Niki Lauda",
	    	"seasons_mclaren":"1982-1985",
	    	"seasons":"1971-1979, 1982-1977",
	    	"wins_mclaren":"8",
	    	"wins":"25",
	    	"poles_mclaren":"0",
	    	"poles":"24",
	    	"races_mclaren":"63",
	    	"races":"174",
		"pic":"Lauda.jpg",
		"description":"Niki Lauda was one of the few drivers that had a successful comeback in Formula 1. He won 3 championships, 2 of which were in the 70s and the last was when he returned to the sport in the 80s.",
 		"career":"He joined Formula 1 in 1971 with March and moved to BRM for 1973. He joined Ferrari in 1974 and became a race winner and world champion the following year. While fighting James Hunt for the title he crashed horribly at the Nurburgring, he was pulled from the burning wreckage and suffered severe burns to his face and lungs. Incredibly, he survived and returned to the track just 6 weeks later but missed out on th title by one point after withdrawing from the last race in Fuji due to the atrocious conditions. He won his second title the next year before leaving Ferrari for Brabham but the 3 years he spent with them were difficult and he retired. However, in 1982 brought him back to drive for McLaren and in 1984 he beat his teamate, Alain Prost, to the title by half a point. After leaving Formula 1, he returned to the business of running the airline he had set up in the late 70s. He returned to Formula 1 in a managerial capacity with Ferrari in the early 90s and then at Jaguar in 2002. He later became a part of Mercedes' management team and played a key role in helping the team and Lewis Hamilton secure there championships."
	},
	{
		"name":"James Hunt",
	    	"seasons_mclaren":"1976-1978",
	    	"seasons":"1973-1979",
	    	"wins_mclaren":"9",
	    	"wins":"10",
	    	"poles_mclaren":"14",
	    	"poles":"14",
	    	"races_mclaren":"49",
	    	"races":"93",
		"pic":"james.jpg",
		"description":"James Hunt was a British Formula 1 driver renowned for his charismatic personality and dramatic 1976 World Championship win.",
 		"career":"After starting in touring cars and progressing through Formula Ford and Formula 3, Hunt joined Hesketh Racing in 1973, making his F1 debut and securing podiums in his rookie season. He achieved his first Grand Prix victory in 1975 at the Dutch Grand Prix. In 1976, Hunt joined McLaren and clinched the World Championship in a season marked by a fierce rivalry with Niki Lauda, who suffered life-threatening injuries mid-season but made a remarkable recovery. Hunt retired from F1 in 1979 and transitioned to a successful broadcasting career with the BBC, known for his candid commentary and dry wit. He passed away in 1993 at the age of 45."
	},
	{
		"name":"Emmerson Fittipaldi",
	    	"seasons_mclaren":"1974-1975",
	    	"seasons":"1970-1980",
	    	"wins_mclaren":"5",
	    	"wins":"14",
	    	"poles_mclaren":"2",
	    	"poles":"6",
	    	"races_mclaren":"29",
	    	"races":"149",
		"pic":"fittipaldi.jpg",
		"description":"Emerson Fittipaldi is a legendary motorsport figure who achieved success in both Formula One and American open-wheel racing.",
 		"career":"He made his Formula One debut in 1970 with Team Lotus and quickly rose to prominence, securing his first Grand Prix victory at the 1970 United States Grand Prix. In 1972, Fittipaldi became the youngest Formula One World Champion at the time, driving for Lotus. He clinched his second World Championship in 1974 with McLaren. In 1976, he joined the Fittipaldi Automotive team, founded by his brother Wilson, marking a significant chapter in his career. After retiring from Formula One in 1980, Fittipaldi transitioned to the CART IndyCar Series, where he won the Indianapolis 500 twice, in 1989 and 1993, and secured the CART Championship in 1989. He retired from full-time racing in 1996 but has remained active in motorsports through various roles, including mentoring young drivers and promoting the sport in Brazil."
	},
	{
		"name":"Lando Norris",
	    	"seasons_mclaren":"2019-present",
	    	"seasons":"2019-present",
	    	"wins_mclaren":"5",
	    	"wins":"5",
	    	"poles_mclaren":"10",
	    	"poles":"10",
	    	"races_mclaren":"135",
	    	"races":"135",
		"pic":"lando.jpg",
		"description":"Lando Norris is a British Formula 1 driver currently competing for McLaren.",
 		"career":"He began his motorsport journey in karting at the age of seven and quickly progressed through the junior single-seater ranks. In 2015, Norris won the MSA Formula Championship, followed by titles in the Toyota Racing Series, Formula Renault Eurocup, and Formula Renault NEC in 2016. He clinched the FIA Formula 3 European Championship in 2017 and finished as the runner-up in the 2018 FIA Formula 2 Championship. Norris made his F1 debut with McLaren in 2019, partnering with Carlos Sainz Jr. In 2020, he secured his first podium finish at the Austrian Grand Prix. The 2024 season marked a significant milestone in his career, as he achieved his first Grand Prix victory at the Miami Grand Prix and went on to win three more races, finishing second in the Drivers' Championship. In 2025, Norris continued his momentum, securing his first win of the season at the Australian Grand Prix. Known for his consistency, adaptability, and strong qualifying performances, Norris has established himself as one of the leading talents in Formula 1."
	},
	{
		"name":"Mika Hakkinen",
	    	"seasons_mclaren":"1993-2001",
	    	"seasons":"1991-2001",
	    	"wins_mclaren":"20",
	    	"wins":"20",
	    	"poles_mclaren":"26",
	    	"poles":"26",
	    	"races_mclaren":"133",
	    	"races":"165",
		"pic":"mika.jpg",
		"description":"Mika Häkkinen is a two-time Formula 1 World Champion renowned for his speed and composure.",
 		"career":"Nicknamed 'The Flying Finn' he began his F1 career in 1991 with Lotus before joining McLaren in 1993. Häkkinen clinched his first World Championship in 1998, defeating Michael Schumacher in a dramatic season. He successfully defended his title in 1999, solidifying his status among F1's elite. After a brief sabbatical in 2002, he returned to racing in the Deutsche Tourenwagen Masters (DTM) with Mercedes, securing three wins over three seasons before retiring in 2007. Post-retirement, Häkkinen has remained active in motorsport as a commentator, brand ambassador, and driver manager, mentoring talents like Valtteri Bottas and Nyck de Vries. His legacy endures as one of F1's most respected and accomplished drivers."
	},
	{
	    	"name":"Alain Prost",
	    	"seasons_mclaren":"1980, 1984-1989",
	    	"seasons":"1980-1991, 1993",
	    	"wins_mclaren":"30",
	   	"wins":"51",
	    	"poles_mclaren":"10",
	    	"poles":"33",
	    	"races_mclaren":"110",
		"races":"199",
		"pic":"prost.jpg",
		"description":"Alain Prost was renowned for his methodical and strategic approach to racing and was nicknamed 'The Professor' and secured 4 WDC.",
 		"career":"He competed for McLaren, Ferrari, and Williams, and was known for his consistency and racecraft, often focusing on maximizing points over raw speed. Prost's rivalry with Ayrton Senna is legendary, with the two drivers often finishing 1–2 in the championship standings during their careers . After retiring in 1993, Prost remained involved in motorsport, founding the Prost Grand Prix team and later serving in advisory roles with Renault and Alpine . His legacy endures as one of Formula 1's most cerebral and accomplished drivers."
	},
	{
	    	"name":"Bruce McLaren",
	    	"seasons_mclaren":"1966-1970",
	    	"seasons":"1958-1970",
	    	"wins_mclaren":"1",
	   	"wins":"4",
	    	"poles_mclaren":"0",
	    	"poles":"0",
	    	"races_mclaren":"56",
		"races":"104",
		"pic":"mclaren.jpg",
		"description":"Bruce McLaren was a pioneering New Zealand racing driver, engineer, and founder of McLaren Racing.",
 		"career":"He made his Formula 1 debut in 1958 with the Cooper team and secured his first Grand Prix victory in 1959 at the U.S. Grand Prix, becoming the youngest winner at that time. McLaren founded his own team, Bruce McLaren Motor Racing, in 1963, and achieved his first Formula 1 win as a team owner at the 1968 Belgian Grand Prix. Beyond F1, he won the 24 Hours of Le Mans in 1966 and dominated the Can-Am series in North America from 1967 to 1971. Tragically, McLaren died in a testing accident in 1970 at the age of 32. His legacy endures through McLaren Racing, which has become a cornerstone of motorsport excellence."
	},
	{
	    	"name":"David Coulthard",
	    	"seasons_mclaren":"1996-2004",
	    	"seasons":"1994-2008",
	    	"wins_mclaren":"13",
	   	"wins":"13",
	    	"poles_mclaren":"7",
	    	"poles":"12",
	    	"races_mclaren":"150",
		"races":"247",
		"pic":"dc.jpg",
		"description":"David Coulthard is a retired Formula 1 driver renowned for his smooth driving style and consistent performances.",
 		"career":"He began his F1 career in 1994 with Williams, securing his first Grand Prix victory in 1995 at the Portuguese Grand Prix. In 1996, Coulthard joined McLaren, where he achieved 12 of his 13 career wins and finished as runner-up in the 2001 Drivers' Championship. After a stint with Red Bull Racing from 2005 to 2008, he retired from F1 with 62 podiums and 535 points. Post-retirement, Coulthard transitioned to broadcasting, serving as a commentator for BBC and Channel 4's F1 coverage. He also co-founded Whisper Films, a media production company, and has been involved in various business ventures. In 2019, he was elected President of the British Racing Drivers' Club, which owns and operates Silverstone Circuit. Additionally, Coulthard co-founded the More Than Equal initiative in 2022, aiming to create opportunities for women to race in Formula 1 during the modern era."
	},
	{
	    	"name":"Jenson Button",
	    	"seasons_mclaren":"2010-2017",
	    	"seasons":"2000-2017",
	    	"wins_mclaren":"8",
	   	"wins":"15",
	    	"poles_mclaren":"1",
	    	"poles":"8",
	    	"races_mclaren":"156",
		"races":"309",
		"pic":"yenson.jpg",
		"description":"Jenson Button is a British racing driver who won the 2009 Formula 1 World Championship with Brawn GP.",
 		"career":"He began his F1 career in 2000 with Williams and achieved his first Grand Prix victory in 2006 at the Hungarian Grand Prix. In 2009, Button secured six wins in the first seven races, clinching the title in Brazil despite not winning further races that season. He continued with McLaren from 2010 to 2016, winning eight races and finishing as runner-up in the 2011 championship. After retiring from F1, Button competed in Super GT in Japan, winning the 2018 GT500 title. He also participated in the World Endurance Championship with Jota, making his debut at the 24 Hours of Le Mans in 2024. Button is involved in various business ventures, including founding the off-road racing team JBXE and launching a whisky brand, Coachbuilt. He also engages in charitable activities through The Jenson Button Trust and serves as a broadcaster for Sky Sports F1."
	}
]
