[
	{
	    	"name":"Lewis Hamilton",
	    	"seasons_mercedes":"2013-2024",
	    	"seasons":"2007-present",
	    	"wins_mercedes":"84",
	   	"wins":"105",
	    	"poles_mercedes":"76",
	    	"poles":"104",
	    	"races_mercedes":"248",
		"races":"364",
		"pic":"lewis.jpg",
		"description":"Lewis Hamilton is a British racing driver who competes in Formula One for Ferrari. He has won a joint-record seven Formula One World Drivers' Championship titles tied with Michael Schumacher and holds the records for most wins (105), pole positions (104), and podium finishes (202) in the sport's history.",
 		"career":"Hamilton began his F1 career with McLaren in 2007, finishing third in his debut season and narrowly missing the title in 2008. He joined Mercedes in 2013, where he achieved unprecedented success, securing six of his seven championships between 2014 and 2020. In 2025, Hamilton transitioned to Ferrari, replacing Carlos Sainz and partnering with Charles Leclerc. Off the track, Hamilton is a prominent advocate for diversity and inclusion in motorsport, founding the Hamilton Commission to promote racial equality. He was knighted in 2021 for his services to motorsport and continues to use his platform to champion social justice causes."
	},
	{
	    	"name":"Nico Rosberg",
	    	"seasons_mercedes":"2010-2016",
	    	"seasons":"2006-2016",
	    	"wins_mercedes":"23",
	   	"wins":"23",
	    	"poles_mercedes":"30",
	    	"poles":"30",
	    	"races_mercedes":"136",
		"races":"206",
		"pic":"rosberg.jpg",
		"description":"Nico Rosberg is a former Formula 1 driver who achieved significant success during his racing career.",
 		"career":"He began his F1 journey in 2006 with Williams and later joined Mercedes in 2010, where he formed a notable partnership with seven-time World Champion Michael Schumacher. Rosberg clinched his first Grand Prix victory at the 2012 Chinese Grand Prix and went on to secure 23 wins, 30 pole positions, and 57 podium finishes over his 11-season career. In 2016, he won the Formula 1 World Championship, narrowly defeating his teammate Lewis Hamilton in a closely contested season. Remarkably, Rosberg announced his retirement from Formula 1 just five days after winning the title, citing a desire to spend more time with his family and avoid burnout."
	},
	{
	    	"name":"George Russell",
	    	"seasons_mercedes":"2022-present",
	    	"seasons":"2019-present",
	    	"wins_mercedes":"3",
	   	"wins":"3",
	    	"poles_mercedes":"5",
	    	"poles":"5",
	    	"races_mercedes":"76",
		"races":"136",
		"pic":"russell.jpg",
		"description":"George Russell is a British Formula 1 driver currently racing for Mercedes-AMG Petronas Formula One Team.",
 		"career":"He began his motorsport journey in karting at the age of seven and quickly progressed through the ranks, winning the BRDC Formula 4 Championship in 2014, the GP3 Series in 2017, and the FIA Formula 2 Championship in 2018. Russell made his F1 debut in 2019 with Williams, where he showcased his talent despite the team's challenges. In 2020, he substituted for Lewis Hamilton at the Sakhir Grand Prix, impressing everyone by nearly securing a win. Russell joined Mercedes in 2022, achieving his first Grand Prix victory at the São Paulo Grand Prix that same year. In 2024, he secured two wins, including the Las Vegas Grand Prix, and finished sixth in the Drivers' Championship. As of the 2025 season, Russell continues to lead Mercedes, partnering with rookie Kimi Antonelli following Hamilton's departure to Ferrari. Despite Mercedes facing challenges in race pace and tyre management, Russell's consistency has kept him in contention for the championship. Team principal Toto Wolff has praised him as one of the top drivers in F1, describing him as a 'warrior'."
	},
	{
	    	"name":"Valtteri Bottas",
	    	"seasons_mercedes":"2017-2021",
	    	"seasons":"2013-2024",
	    	"wins_mercedes":"10",
	   	"wins":"10",
	    	"poles_mercedes":"20",
	    	"poles":"20",
	    	"races_mercedes":"101",
		"races":"247",
		"pic":"bottas.jpg",
		"description":"Valtteri Bottas is a Finnish racing driver known for his smooth driving style and consistency.",
 		"career":"He began his Formula 1 career in 2013 with Williams, achieving his first podium finish in 2014. In 2017, Bottas joined Mercedes-AMG Petronas Formula One Team, securing 10 race wins, 20 pole positions, and 58 podiums over five seasons. He finished as runner-up in the Drivers' Championship twice, in 2019 and 2020, behind teammate Lewis Hamilton. In 2022, Bottas moved to Alfa Romeo, which rebranded as Stake F1 Team Kick Sauber in 2024. The 2024 season proved challenging, with Bottas failing to score points for the first time in his F1 career. Following this, he departed Sauber and returned to Mercedes as a reserve driver for the 2025 season, supporting main drivers George Russell and rookie Kimi Antonelli."
	},
	{
	    	"name":"Juan Manuel Fangio",
	    	"seasons_mercedes":"1954-1955",
	    	"seasons":"1950-1951, 1953-1958",
	    	"wins_mercedes":"8",
	   	"wins":"24",
	    	"poles_mercedes":"7",
	    	"poles":"29",
	    	"races_mercedes":"12",
		"races":"52",
		"pic":"fangio.jpg",
		"description":"Juan Manuel Fangio often hailed as one of the greatest drivers in Formula 1 history and competed in F1 from 1950 to 1958  and secured five WDC.",
 		"career":"He won the championships in 1951, 1954, 1955, 1956, 1957 driving for Alfa Romeo, Mercedes-Benz, Ferrari, and Maserati. He achieved this feat in just seven full seasons, missing one due to a near-fatal accident. His adaptability was unparalleled, winning titles with four different teams. One of his most iconic performances was at the 1957 German Grand Prix at the Nürburgring, where he overcame a 48-second deficit to clinch victory, securing his fifth and final title in dramatic fashion. After retiring from racing in 1958, Fangio remained an ambassador for the sport and later became a representative for Mercedes-Benz in Argentina. He passed away on July 17, 1995, leaving behind a legacy that continues to inspire generations of drivers."
	}
]
