[
	{
	    	"name":"Sebastian Vettel",
	    	"seasons_vcarb":"2007-2008",
	    	"seasons":"2007-2022",
	    	"wins_vcarb":"1",
	   	"wins":"53",
	    	"poles_vcarb":"1",
	    	"poles":"57",
	    	"races_vcarb":"25",
		"races":"300",
		"pic":"finger.jpg",
		"description":"Sebastian Vettel was a child prodigy and joined Formula 1 when he was just 19 years old. In 2010 he became the youngest ever world champion at 23 years old and dominated the sport for the following 3 years accumulating 4 in total.",
 		"career":"He made his Formula 1 debur in 2007 driving for BMW Sauber where he became the youngest driver to score points before he moveds to Toro Rosso for the second half of the year and 2008. At the Italian Grand Prix in 2008 he became the youngest driver in history to win a Grand Prix meaning the Red Bull junior team won a race before the main team. Toro Rosso also finished above Red Bull in the standings that year.</p><p>Vettel moved to Red Bull for 2009 where he won the second race of the season in China which was also Red Bull's first win. The team and Vettel ended up second in their respective championships. In 2010 he was just about in the title fight bewteen his teamate Mark Webber, the McLaren drivers (Hamilton and Button) and Ferrari driver Fernando Alonso. He won by 4 points at the last race of the season in Abu Dhabi making him the youngest driver to ever win a WDC. He dominated the 2011 season winning 11 out of the 19 races and podium finishes in 17 of them. The 2012 title fight was a bit closer but be ended up winning it by 3 points to Fernando Alonso. 2013 was the year he won his last championship but it was also his most dominante winning 13 out of 19 races. This year also made him the most hated Formula 1 driver for how much he kept winning and his attitude meaning on multiple occassions he was booed by fans. This year also saw the infamous multi-21 incident where his teamate Webber was P1 and Vettel P2 and after being told to keep position he overtook Webber and won the race. This lead to Webber remarking 'multi 21 Seb, yeah multi 21' in the cooldown room, increased tensions between the two and in the team and increase hate for Vettel especially after he said that '[he does] not apoligise for winning'. The following year he couldn't get to grips with the new tyres and the RB10 and suffered from reliability problems meaning he was beaten by his new young teamate Daniel Riccardo.</p><p>He moved to Ferrari for the 2015 season to race alongside Kimi Raikkonen. They performed really well however the Mercedes were in another league and beat everyone by a mile but Vettel still won a few races. 2016 was much the same but Red Bull were more of a chanllenge as well. 2017 was Vettel's firsty chance at fightinh for a championship since 2013. He took the lead in the beginning of the season but by the British Grand Prix his lead was cut to only 1 point but by the end of the year Hamilton has passed him and won. He did manage to split the Mercedes though which was the first time the championship hadn't ended 1-2 for Mercedes since 2014. The 2018 season was dubbed the 'Fight For Five' as the two 4 time world champions were in a title fight and like the season before Vettel got of to a good start but it was close for most of the season. A notable race was his home race on Hockenheim where he crashed as rain started causing him to break his front wing; some poeple would say he was never the same after this moment as it cost him his last chance at another title. In 2019 he had a new teamate Charles Leclerc who was only in his second season who ended up outscoring him and Vettel finished the season 5th. 2020 was his last year with Ferrari and with the SF1000 lackingpace he had his worst full campaign in his Formula 1 career.</p><p>For the last 2 years of his career he raced for Aston Martin alongside Lance Stroll and outscored him in both seasons and had the most overtakes in 2019 that won him the inaugural Overtake Award. He missed the first 2 races of the 2022 season due to positive COVID-19 tests and announced his retiremant by the end of the 2022 season. Since retiring Vettel has used his notariaty to raise awareness for environmental issues and social injustices."
	},
	{
	    	"name":"Max Verstappen",
	    	"seasons_redbull":"2016-present",
	    	"seasons":"2015-2016",
	    	"wins_redbull":"64",
	   	"wins":"64",
	    	"poles_redbull":"43",
	    	"poles":"43",
	    	"races_redbull":"191",
		"races":"215",
		"pic":"verstappen.jpg",
		"description":"Max Verstappen is one of the best drivers in history and has won 4 WDC with Red Bull and has pulled off some incredible drives throughout his career that have secured him as one of the greats.",
 		"career":"Verstappen made his Formula 1 debut in 2015 with Toro Rosso when he was 17 years old and was moved to the main team after 4 races in 2016 to be teamate to Daniel Riccardo. At his first race with Red Bull he won the race and became the youngest driver to win a race at 18 yeas old. In 2018 he beat Riccardo in the championship and caused him to belive that he wouldn't have a future at Red Bull with Verstappen also there. 2019 began Verstappen's dominance in the team and had many teamates that couldn't drive near his level. He claimed his first title in 2021 after a fierce battle between himself and Lewis Hamilton that came down to a last lap overtake by Verstappen. Many Hamilton fans say he deserved the title as the race director made up rules under safty car that lead to the last lap of racing but officially it was Verstappen that won. He had a fight with Leclerc in 2022 but still won fairly comfortably but the next year he dominated. Out of the 22 races he won 19 of them which is more that any driver in a single season before. 2024 saw Lando Norris have a go at the title but Verstappen still claimed it in the end with little struggle. This year has been more dificult with the Red Bull car having problems but he has still put in some good perfomances and is still in the fight for the title."
	}
]
