[
	{
	    	"name":"Alain Prost",
	    	"seasons_williams":"1993",
	    	"seasons":"1980-1991, 1993",
	    	"wins_williams":"7",
	   	"wins":"51",
	    	"poles_williams":"13",
	    	"poles":"33",
	    	"races_williams":"16",
		"races":"199",
		"pic":"prost.jpg",
		"description":"Alain Prost was renowned for his methodical and strategic approach to racing and was nicknamed 'The Professor' and secured 4 WDC.",
 		"career":"He competed for McLaren, Ferrari, and Williams, and was known for his consistency and racecraft, often focusing on maximizing points over raw speed. Prost's rivalry with Ayrton Senna is legendary, with the two drivers often finishing 1–2 in the championship standings during their careers . After retiring in 1993, Prost remained involved in motorsport, founding the Prost Grand Prix team and later serving in advisory roles with Renault and Alpine . His legacy endures as one of Formula 1's most cerebral and accomplished drivers."
	},
	{
	    	"name":"Nigel Mansell",
	    	"seasons_williams":"1985-1988, 1991-1992",
	    	"seasons":"1980-1992, 1994-1995",
	    	"wins_williams":"28",
	   	"wins":"31",
	    	"poles_williams":"28",
	    	"poles":"32",
	    	"races_williams":"96",
		"races":"187",
		"pic":"mansell.jpg",
		"description":"Nigel Mansell was celebrated for his tenacity and aggressive driving style and he won the WDC in 1992 for Williams.",
 		"career":"Mansell secured 31 Grand Prix victories and clinched the 1992 World Championship with Williams, where he dominated the season with nine wins and five pole positions. Notably, he remains the last driver to win an F1 race over the age of 40, achieving this feat at the 1994 Australian Grand Prix in Adelaide, his 31st and final career victory. Beyond F1, Mansell ventured into American open-wheel racing, winning the 1993 IndyCar World Series with Newman/Haas Racing, making him the only driver to hold both the Formula 1 World Championship and the American open-wheel National Championship simultaneously. His legacy endures as one of Britain's most accomplished and charismatic motorsport figures."
	}
]
