[
	{
	    	"name":"Alain Prost",
	    	"seasons_williams":"1993",
	    	"seasons":"1980-1991, 1993",
	    	"wins_williams":"7",
	   	"wins":"51",
	    	"poles_williams":"13",
	    	"poles":"33",
	    	"races_williams":"16",
		"races":"199",
		"pic":"prost.jpg",
		"description":"Alain Prost was renowned for his methodical and strategic approach to racing and was nicknamed 'The Professor' and secured 4 WDC.",
 		"career":"He competed for McLaren, Ferrari, and Williams, and was known for his consistency and racecraft, often focusing on maximizing points over raw speed. Prost's rivalry with Ayrton Senna is legendary, with the two drivers often finishing 1–2 in the championship standings during their careers . After retiring in 1993, Prost remained involved in motorsport, founding the Prost Grand Prix team and later serving in advisory roles with Renault and Alpine . His legacy endures as one of Formula 1's most cerebral and accomplished drivers."
	},
	{
	    	"name":"Nigel Mansell",
	    	"seasons_williams":"1985-1988, 1991-1992",
	    	"seasons":"1980-1992, 1994-1995",
	    	"wins_williams":"28",
	   	"wins":"31",
	    	"poles_williams":"28",
	    	"poles":"32",
	    	"races_williams":"96",
		"races":"187",
		"pic":"mansell.jpg",
		"description":"Nigel Mansell was celebrated for his tenacity and aggressive driving style and he won the WDC in 1992 for Williams.",
 		"career":"Mansell secured 31 Grand Prix victories and clinched the 1992 World Championship with Williams, where he dominated the season with nine wins and five pole positions. Notably, he remains the last driver to win an F1 race over the age of 40, achieving this feat at the 1994 Australian Grand Prix in Adelaide, his 31st and final career victory. Beyond F1, Mansell ventured into American open-wheel racing, winning the 1993 IndyCar World Series with Newman/Haas Racing, making him the only driver to hold both the Formula 1 World Championship and the American open-wheel National Championship simultaneously. His legacy endures as one of Britain's most accomplished and charismatic motorsport figures."
	},
	{
	    	"name":"Felipe Massa",
	    	"seasons_williams":"2014-2017",
	    	"seasons":"2002, 2004-2017",
	    	"wins_williams":"0",
	   	"wins":"11",
	    	"poles_williams":"0",
	    	"poles":"16",
	    	"races_williams":"65",
		"races":"272",
		"pic":"massa.jpg",
		"description":"Felipe Massa raced from 2002 to 2017, primarily known for his time with Ferrari (2006–2013).",
 		"career":"After debuting with Sauber, he joined Ferrari and quickly became a race winner, serving as both a strong teammate to Michael Schumacher and later a title contender. His closest brush with the championship came in 2008, when he famously lost the title to Lewis Hamilton by just one point in a dramatic final-lap twist at the Brazilian Grand Prix. Massa won 11 races, scored 41 podiums, and earned a reputation for his speed, technical skill, and resilience—especially after a life-threatening head injury in 2009. He finished his F1 career with Williams before retiring in 2017, leaving behind a legacy as one of Brazil’s most respected drivers."
	},
	{
	    	"name":"George Russell",
	    	"seasons_williams":"2019-2021",
	    	"seasons":"2019-present",
	    	"wins_williams":"0",
	   	"wins":"3",
	    	"poles_williams":"0",
	    	"poles":"5",
	    	"races_williams":"60",
		"races":"135",
		"pic":"russell.jpg",
		"description":"George Russell is a British Formula 1 driver currently racing for Mercedes-AMG Petronas Formula One Team.",
 		"career":"He began his motorsport journey in karting at the age of seven and quickly progressed through the ranks, winning the BRDC Formula 4 Championship in 2014, the GP3 Series in 2017, and the FIA Formula 2 Championship in 2018. Russell made his F1 debut in 2019 with Williams, where he showcased his talent despite the team's challenges. In 2020, he substituted for Lewis Hamilton at the Sakhir Grand Prix, impressing everyone by nearly securing a win. Russell joined Mercedes in 2022, achieving his first Grand Prix victory at the São Paulo Grand Prix that same year. In 2024, he secured two wins, including the Las Vegas Grand Prix, and finished sixth in the Drivers' Championship. As of the 2025 season, Russell continues to lead Mercedes, partnering with rookie Kimi Antonelli following Hamilton's departure to Ferrari. Despite Mercedes facing challenges in race pace and tyre management, Russell's consistency has kept him in contention for the championship. Team principal Toto Wolff has praised him as one of the top drivers in F1, describing him as a 'warrior'."
	},
	{
	    	"name":"Valtteri Bottas",
	    	"seasons_williams":"2013-2016",
	    	"seasons":"2013-2024",
	    	"wins_williams":"0",
	   	"wins":"10",
	    	"poles_williams":"0",
	    	"poles":"20",
	    	"races_williams":"78",
		"races":"247",
		"pic":"bottas.jpg",
		"description":"Valtteri Bottas is a Finnish racing driver known for his smooth driving style and consistency.",
 		"career":"He began his Formula 1 career in 2013 with Williams, achieving his first podium finish in 2014. In 2017, Bottas joined Mercedes-AMG Petronas Formula One Team, securing 10 race wins, 20 pole positions, and 58 podiums over five seasons. He finished as runner-up in the Drivers' Championship twice, in 2019 and 2020, behind teammate Lewis Hamilton. In 2022, Bottas moved to Alfa Romeo, which rebranded as Stake F1 Team Kick Sauber in 2024. The 2024 season proved challenging, with Bottas failing to score points for the first time in his F1 career. Following this, he departed Sauber and returned to Mercedes as a reserve driver for the 2025 season, supporting main drivers George Russell and rookie Kimi Antonelli."
	},
	{
	    	"name":"Alan Jones",
	    	"seasons_williams":"1978-1981",
	    	"seasons":"1975-1981, 1983, 1985-1986",
	    	"wins_williams":"11",
	   	"wins":"12",
	    	"poles_williams":"6",
	    	"poles":"6",
	    	"races_williams":"107",
		"races":"117",
		"pic":"alan.jpg",
		"description":"Alan Jones is a former Formula 1 driver who achieved significant success during his racing career.",
 		"career":"He made his F1 debut in 1975 and competed in 117 Grands Prix over a span of 11 seasons. Jones secured 12 Grand Prix victories, with his first win at the 1977 Austrian Grand Prix and his last at the 1981 Caesars Palace Grand Prix. Notably, he won the 1980 Formula 1 World Drivers' Championship driving for Williams, becoming the first Australian to win the title since Sir Jack Brabham. That same year, he also secured the Australian Grand Prix victory at Calder Park Raceway, marking him as the last Australian driver to win the event. In 1980, Jones clinched the World Drivers' Championship with Williams, contributing to the team's first Constructors' Championship. He achieved five wins that season, including victories in Argentina, France, Britain, Canada, and the United States, and finished on the podium in 10 of the 14 races. His consistent performances and strategic racing were pivotal in securing the championship. After retiring from Formula 1 in 1986, Jones transitioned to a career in broadcasting and has remained active in motorsport-related activities. He is also known for his involvement in the Australian S5000 category, which aims to unearth new F1 talent."
	},
	{
	    	"name":"Damon Hill",
	    	"seasons_williams":"1992-1999",
	    	"seasons":"1993-1996",
	    	"wins_williams":"21",
	   	"wins":"22",
	    	"poles_williams":"20",
	    	"poles":"20",
	    	"races_williams":"65",
		"races":"122",
		"pic":"hill.jpg",
		"description":"Damon Hill, born on September 17, 1960, in London, is a former Formula 1 driver who made history by becoming the first son of a World Champion to win the F1 World Drivers' Championship, following in the footsteps of his father, Graham Hill.",
 		"career":"Hill began his F1 career in 1992 as a test driver for Williams and secured his first race victory in 1993 at the Hungarian Grand Prix. He clinched the World Championship in 1996 with Williams, achieving eight wins that season. After a challenging 1997 season with Arrows, Hill joined Jordan Grand Prix, where he delivered the team's first-ever F1 victory at the 1998 Belgian Grand Prix. He retired from racing in 1999 with a total of 22 Grand Prix wins and 42 podium finishes. Post-retirement, Hill served as president of the British Racing Drivers' Club, secured a long-term contract for Silverstone to host F1 races, and contributed to motorsport broadcasting. He was awarded an OBE in 1997 and has been recognized as one of the top 15 winning drivers in F1 history."
	},
	{
	    	"name":"Juan Pablo Montoya",
	    	"seasons_williams":"2001-2004",
	    	"seasons":"2001-2006",
	    	"wins_williams":"4",
	   	"wins":"7",
	    	"poles_williams":"11",
	    	"poles":"13",
	    	"races_williams":"68",
		"races":"95",
		"pic":"montoya.jpg",
		"description":"Juan Pablo Montoya is a versatile racing driver renowned for his aggressive style and adaptability across various motorsport disciplines.",
 		"career":"He began his Formula 1 career in 2001 with Williams, securing his first Grand Prix victory at the 2001 Italian Grand Prix. Over his F1 tenure, Montoya achieved seven wins, including notable victories at the 2003 Monaco Grand Prix and the 2005 Brazilian Grand Prix. In 2006, he joined McLaren, where he secured additional wins and podiums. Montoya's F1 career concluded in 2006 before he transitioned to American motorsport, competing in IndyCar, NASCAR, and endurance racing. He remains one of the few drivers to have won both the Monaco Grand Prix and the Indianapolis 500, bringing a unique blend of open-wheel and stock car racing experience to his illustrious career."
	},
	{
	    	"name":"Riccardo Patrese",
	    	"seasons_williams":"1987-1992",
	    	"seasons":"1977-1993",
	    	"wins_williams":"4",
	   	"wins":"6",
	    	"poles_williams":"6",
	    	"poles":"8",
	    	"races_williams":"81",
		"races":"254",
		"pic":"patrese.jpg",
		"description":"Riccardo Patrese is a former Formula 1 driver who competed in 256 races over 17 seasons, making him one of the most experienced drivers in the sport's history.",
 		"career":"He began his Formula 1 career in 2001 with Williams, securing his first Grand Prix victory at the 2001 Italian Grand Prix. Over his F1 tenure, Montoya achieved seven wins, including notable victories at the 2003 Monaco Grand Prix and the 2005 Brazilian Grand Prix. In 2006, he joined McLaren, where he secured additional wins and podiums. Montoya's F1 career concluded in 2006 before he transitioned to American motorsport, competing in IndyCar, NASCAR, and endurance racing. He remains one of the few drivers to have won both the Monaco Grand Prix and the Indianapolis 500, bringing a unique blend of open-wheel and stock car racing experience to his illustrious career."
	},
	{
	    	"name":"Keke Rosberg",
	    	"seasons_williams":"1987-1992",
	    	"seasons":"1982-1986",
	    	"wins_williams":"5",
	   	"wins":"5",
	    	"poles_williams":"5",
	    	"poles":"5",
	    	"races_williams":"62",
		"races":"128",
		"pic":"keke.jpg",
		"description":"Keke Rosberg is a Finnish former Formula 1 driver who secured the 1982 World Drivers' Championship with Williams, becoming the first Finnish F1 World Champion.",
 		"career":"Over his 128-race career, Rosberg achieved five Grand Prix victories, including wins at the 1982 Swiss Grand Prix, the 1983 Monaco Grand Prix, the 1984 Dallas Grand Prix, and the 1985 Detroit and Australian Grands Prix. His 1982 championship was notable for its competitiveness, with 11 different race winners that season. Rosberg's driving style was characterized by aggression and adaptability. After retiring from Formula 1 in 1986, he remained active in motorsport, transitioning into rallycross and other racing disciplines. He also became a commentator and an influential figure in the motorsport world, offering valuable insights into the sport’s technicalities and the art of racing. Rosberg's legacy extended to his son, Nico Rosberg, who followed in his father's footsteps and won the Formula 1 World Championship in 2016. Nico's achievement further solidified the Rosberg family's iconic status in the motorsport world, making them one of the most famous father-son pairings in the history of Formula 1."
	},
	{
	    	"name":"Nelson Piquet",
	    	"seasons_williams":"1986-1987",
	    	"seasons":"1978-1991",
	    	"wins_williams":"6",
	   	"wins":"23",
	    	"poles_williams":"5",
	    	"poles":"24",
	    	"races_williams":"31",
		"races":"204",
		"pic":"Piquet.jpg",
		"description":"Nelson Piquet is a former Formula 1 driver who won three World Drivers' Championships (1981, 1983, and 1987) during his 14-season career.",
 		"career":"He began his F1 journey with Ensign in 1978 and later drove for Brabham, where he secured his first title in 1981. Piquet clinched his second championship in 1983 with Brabham, and his third in 1987 with Williams, famously engaging in a tense intra-team rivalry with Nigel Mansell. Known for his tactical acumen and adaptability, he achieved 23 Grand Prix victories and 60 podium finishes. After retiring from F1 in 1991, Piquet briefly pursued IndyCar racing and sports car events. He has since been involved in various business ventures in Brazil. Piquet is also the father of Kelly Piquet, a prominent figure in motorsport, and Nelson Piquet Jr., who competed in F1 and won the Formula E championship in the 2014–15 season."
	},
	{
	    	"name":"Jacques Villeneuve",
	    	"seasons_williams":"1996-1998",
	    	"seasons":"1996-2006",
	    	"wins_williams":"11",
	   	"wins":"11",
	    	"poles_williams":"13",
	    	"poles":"13",
	    	"races_williams":"49",
		"races":"163",
		"pic":"villeneuve.jpg",
		"description":"Jacques Villeneuve is a former Formula 1 driver who won the 1997 World Drivers' Championship with Williams, becoming the first Canadian to achieve this feat.",
 		"career":"He began his F1 career in 1996, finishing second in the championship in his rookie season. Villeneuve secured 11 Grand Prix victories over his career, with his final win at the 1997 Luxembourg Grand Prix. After a challenging 1998 season, he joined British American Racing (BAR), where he raced until 2003. He then drove for Renault, Sauber, and BMW Sauber before retiring from F1 in 2006. Post-F1, Villeneuve competed in various motorsport disciplines, including NASCAR and sports car racing, and achieved a second-place finish at the 2008 Le Mans 24 Hours. He also participated in the 2022 Daytona 500, joining an exclusive group of drivers who have competed in the Indy 500, Le Mans 24 Hours, and Formula 1. Villeneuve remains active in motorsport as a commentator and ambassador for Williams Racing."
	}
]
